export const crutch = {
  id: 127,
  title: 'Чистый код: создание, анализ и рефакторинг. Библиотека прогаммиста',
  rating: 3.5,
  issueYear: '2010',
  description:
    'Даже плохой программный код может работать. Однако если код не является «чистым», это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и «укрощение».\r\nЭта книга посвящена хорошему программированию. Она полна реальных примеров кода. Мы будем рассматривать код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Прочитав книгу, вы узнаете много нового о коде. Более того, вы научитесь отличать хороший код от плохого. Вы узнаете, как писать хороший код и как преобразовать плохой код в хороший.\r\nКнига состоит из трех частей. В первой части излагаются принципы, паттерны и приемы написания чистого кода; приводится большой объем примеров кода. Вторая часть состоит из практических сценариев нарастающей сложности. Каждый сценарий представляет собой упражнение по чистке кода или преобразованию проблемного кода в код с меньшим количеством проблем. Третья часть книги — концентрированное выражение ее сути. Она состоит из одной главы с перечнем эвристических правил и «запахов кода», собранных во время анализа. Эта часть представляет собой базу знаний, описывающую наш путь мышления в процессе чтения, написания и чистки кода.',
  publish: '\r\nПитер',
  pages: '464',
  cover: 'Мягкий переплет',
  weight: '555',
  format: '70x100/16',
  ISBN: '978-5-49807-381-1',
  producer: 'Издательский дом «Питер»',
  authors: ['Роберт Мартин '],
  images: [
    {
      url: '/uploads/1001563239_b0cf866a9f.webp',
    },
  ],
  categories: ['Программирование'],
  comments: [
    {
      id: 1336,
      rating: 5,
      text: 'новый комментарий',
      createdAt: '2023-03-24T21:02:43.067Z',
      user: {
        commentUserId: 964,
        firstName: 'Viachaslau',
        lastName: 'Dmitruk',
        avatarUrl: null,
      },
    },
    {
      id: 1365,
      rating: 2,
      text: 'I hate Fedor Sumkin',
      createdAt: '2023-03-25T05:58:25.771Z',
      user: {
        commentUserId: 995,
        firstName: 'Toster123',
        lastName: 'Toster123',
        avatarUrl: null,
      },
    },
  ],
  booking: {
    id: 4630,
    order: true,
    dateOrder: '2023-03-27T00:00:00.000Z',
    customerId: 962,
    customerFirstName: 'Андрей',
    customerLastName: 'Кравцов',
  },
  delivery: null,
  histories: null,
};
